gender_dict = {0: '男',
               1: '女'}

age_dict_v1 = {0: '16以下',
               1: '17-30',
               2: '34-45'}

age_dict_v2 = {0: '16以下',
               1: '17-30',
               2: '31-45',
               3: '46-60',
               4: '60+'}

age_dict_fair = {0: '0-2',
                 1: '3-9',
                 2: '10-19',  # 少年
                 3: '20-29',
                 4: '30-39',  # 青年
                 5: '40-49',
                 6: '50-59',  # 中年
                 7: '60-69',
                 8: '70+'}  # 老年

age_dict = {
    0: '少年（20以下）',
    1: '青年（20-40）',
    2: '中年（40-60）',
    3: '老年（60以上）'
}

race_dict = {0: '白种人',
             1: '黑种人',
             2: '拉丁裔西班牙人',
             3: '黄种人',
             4: '黄种人',  # '东南亚黄种人',
             5: '印度人',  # 印第安人
             6: '白种人'}  # '中东人'}

race_dict_ = {0: '白种人',
              1: '黑种人',
              2: '拉丁裔西班牙人',
              3: '黄种人',
              4: '东南亚黄种人',  # '东南亚黄种人',
              5: '印度人',  # 印第安人
              6: '中东人'}  # '中东人'}

body_dict = {0: '微胖',
             1: '标准',
             2: '偏瘦'}

hs_dict = {0: '戴帽',
           1: '眼镜',
           2: '围巾',
           3: '无'}

up_dict = {0: '衬衣',
           1: '毛衣',
           2: '马甲',
           3: 'T恤',
           4: '棉服',
           5: '夹克',
           6: '西服',
           7: '卫衣',
           8: '短袖'}

lb_dict = {0: '长裤',
           1: '裙子',
           2: '短裙',
           3: '连衣裙',
           4: '牛仔裤',
           5: '包腿裤'}

shoes_dict = {0: '皮鞋',
              1: '运动鞋',
              2: '靴子',
              3: '布鞋',
              4: '休闲鞋'}

attach_dict = {0: '双肩包',
               1: '单肩包',
               2: '手提包',
               3: '箱子',
               4: '塑料袋',
               5: '纸袋',
               6: '车',
               7: '无'}

action_dict = {0: '打电话',
               1: '交谈',
               2: '聚集',
               3: '抱东西',
               4: '推东西',
               5: '拉拽东西',
               6: '夹带东西',
               7: '拎东西',
               8: '其他'}

hair_style_dict = {0: '秃头',
                   1: '直发',
                   2: '卷发'}

hair_style_dict_rap = {0: '秃头',
                       1: '长发',
                       2: '短发'}

hair_color_dict = {
    0: '黑发',
    1: '金发',
    2: '棕发',
    3: '灰白发'
}

hair_color_dict_rap = {
    0: '黑发',
    1: '其他',
}

is_dict = {
    0: '是',
    1: '否'
}

id2class = {
    0: 'Mask',
    1: 'NoMask'
}
